УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартНеПроверятьРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартОтветсвтенныйЗаРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4aa81cd-18f1-4902-9c1f-c902893806b3">
    <name>смартГенеральныйДиректор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="766ca5a6-8585-4744-82ef-ceeb65521cb2">
    <name>смартБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47683048-9c72-4bdd-96b5-bc2b6dcad26a">
    <name>смартОтветственныйЗаЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cfd754c-c822-4e79-b5ab-2ee7ff24fb99">
    <name>смартСтатусКонтактныхДанныхКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a7affe-e81a-4e16-9597-b677a73ec63f">
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d433a349-afcf-447e-ae95-310605a8cb7a">
    <name>смартНеОбновлятьКППВноситБухгалтерия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4b318cc3-2f5c-4b35-9733-92b8480d218b">
    <name>смартЛогинНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45c407b4-0b68-47cd-a142-a06f4a184f90">
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1507bf85-d479-4d4c-b34f-ae3f3fbe92d0">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/CRM_УправлениеКонтактнойИнформациейКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация".
//
////////////////////////////////////////////////////////////////////////////////

#Область ДоработкиСмарт

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации
&ИзменениеИКонтроль("ПриИзменении")
Процедура смарт_ПриИзменении(Форма, Элемент, ЭтоТабличнаяЧасть)

	ЭтоТабличнаяЧасть = ЭтоТабличнаяЧасть(Элемент);

	Если ЭтоТабличнаяЧасть Тогда
		ДанныеЗаполнения = Форма.Элементы[Форма.ТекущийЭлемент.Имя].ТекущиеДанные;
		Если ДанныеЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ДанныеЗаполнения = Форма;
	КонецЕсли;

	// Если это очистка, то сбрасываем представление.
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент, ЭтоТабличнаяЧасть);
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	// +CRM
	Попытка
		Если Элемент.Вид <> ВидПоляФормы.ПолеНадписи Тогда
			Текст = СокрЛП(Элемент.ТекстРедактирования);
			Форма[ДанныеСтроки.ИмяРеквизита] = Текст;
		Иначе
			Текст = Форма[ДанныеСтроки.ИмяРеквизита];
		КонецЕсли; 
	Исключение
	КонецПопытки;
	//Текст = Элемент.ТекстРедактирования;
	// -CRM

	Если ПустаяСтрока(Текст) Тогда

		ДанныеЗаполнения[Элемент.Имя] = "";
		Если ЭтоТабличнаяЧасть Тогда
			ДанныеЗаполнения[Элемент.Имя + "Значение"] = "";
		КонецЕсли;
		ДанныеСтроки.Представление = "";
		ДанныеСтроки.Значение      = "";
		Результат = Новый Структура("ОбновитьКонтекстноеМеню, ИмяЭлементаДляРазмещения", Истина, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		Если ДанныеСтроки.ИмяЭлементаДляРазмещения <> "" Тогда
			ОбновитьКонтекстноеМеню(Форма, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		КонецЕсли;
		Возврат;

	КонецЕсли;

	// +CRM
	// Разложить строку телефона по полям
	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")
		ИЛИ ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс") Тогда
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Текст);
		ДанныеСтроки.Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		ЗначенияПолей = Новый Структура;
		ЗначенияПолей.Вставить("countryCode", СтруктураТелефона.КодСтраны);
		ЗначенияПолей.Вставить("areaCode", СтруктураТелефона.КодГорода);
		ЗначенияПолей.Вставить("number", СтруктураТелефона.НомерТелефона);
		ЗначенияПолей.Вставить("extNumber", СтруктураТелефона.Добавочный);
		ЗначенияПолей.Вставить("value", ДанныеСтроки.Представление);
		ЗначенияПолей.Вставить("comment", ДанныеСтроки.Комментарий);
		ДанныеСтроки.Значение = CRM_ОбщегоНазначенияСервер.СтруктураВСтрокуJSON(ЗначенияПолей);
		Попытка
			Форма[ДанныеСтроки.ИмяРеквизита] = ДанныеСтроки.Представление;
		Исключение
		КонецПопытки;
	Иначе
		// -CRM
		ДанныеСтроки.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Текст, ДанныеСтроки.Вид);
		ДанныеСтроки.Представление = Текст;

		Если ЭтоТабличнаяЧасть Тогда
			ДанныеЗаполнения[Элемент.Имя + "Значение"]      = ДанныеСтроки.Значение;
		КонецЕсли;
		// +CRM
	КонецЕсли;
	// -CRM

	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Результат = Новый Структура("ОбновитьКонтекстноеМеню, ИмяЭлементаДляРазмещения", Истина, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		ОбновитьКонтактнуюИнформациюФормы(Форма, Результат)
	КонецЕсли;

	#Вставка
	
	//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации
	СтрокиКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", Элемент.Имя));
	ДанныеСтроки = ?(СтрокиКонтактнойИнформации.Количество() = 0, Неопределено, СтрокиКонтактнойИнформации[0]);
	
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") 
		И Не Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда //+-#1012 смарт: Каратеев 06.10.2022 Исправление доработки 1012 //Убрал проверку дубля email у контрагента.
		
		Текст = Элемент.ТекстРедактирования;
		
		Если ПустаяСтрока(Текст) Тогда
			Возврат;
		КонецЕсли;
		
		//++#1256 смарт: Лопато 03.06.2024 //Изменить проверку на дубли email при вводе в Контактном лице (продолжение задачи 1012)  
		Если Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая" Тогда 
			ПартнерКЛ = Форма.Объект.Владелец;
		Иначе
			ПартнерКЛ = Неопределено;
		КонецЕсли;
		
		ИтогПроверки = смартОбщегоНазначения.ПроверитьАдресЭлектроннойПочты(Текст, Форма.Объект.Ссылка, ПартнерКЛ);
		//--#1256 смарт: Лопато 03.06.2024
		
		Если ИтогПроверки.КодОшибки <> 0 Тогда

			//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
			ОчиститьСообщения();

			ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
			
			Если ИтогПроверки.КодОшибки = 12 И ИтогПроверки.Свойство("МассивДублей") Тогда
				
				Для Каждого ЭлементДубль Из ИтогПроверки.МассивДублей Цикл
					ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДубль.ТекстСообщения, ЭлементДубль.Ключ);
				КонецЦикла;
				
			Иначе
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
				
			КонецЕсли;
			//-- #1152 смарт: Лопато 18.10.2024
			
			Форма[ДанныеСтроки.ИмяРеквизита] = "";
			СтрокиКонтактнойИнформации[0].Представление = "";
			СтрокиКонтактнойИнформации[0].Значение = "";
			
		КонецЕсли;
		
	ИначеЕсли ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда 
		
		Текст = Элемент.ТекстРедактирования;
		
		Если ПустаяСтрока(Текст) Тогда
			Возврат;
		КонецЕсли;
		
		//++ #1651 смарт: Лопато 18.03.2024 // Телефония. Хранение истории контактной информации пользователей
		// Для внутренних номеров отключаем проверку
		Если Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ДанныеСтроки.Вид, "смартВнутреннийНомерТелефона") Тогда
			Возврат;
		КонецЕсли;
		//-- #1651 смарт: Лопато 18.03.2024

		//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
		СтруктураПроверки = Новый Структура;
		
		СтруктураПроверки.Вставить("Значение"     , ДанныеСтроки.Значение);
		СтруктураПроверки.Вставить("Представление", ДанныеСтроки.Представление);
		СтруктураПроверки.Вставить("Ссылка"       , Форма.Объект.Ссылка);

		Если Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая"
			ИЛИ Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.ФормаЭлемента" Тогда 

			СтруктураПроверки.Вставить("Владелец", Форма.Объект.Владелец);
			
		ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
			
			СтруктураПроверки.Вставить("Владелец", Форма.Объект.Партнер);
			
		Иначе
			
			СтруктураПроверки.Вставить("Владелец", Неопределено);
			
		КонецЕсли;
		
		ИтогПроверки = смартОбщегоНазначения.ПроверитьТелефон(СтруктураПроверки); 
		
		Если ИтогПроверки.КодОшибки <> 0 Тогда

			ОчиститьСообщения();
			
			Если ИтогПроверки.КодОшибки = 12 И ИтогПроверки.Свойство("МассивДублей") Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
				
				Для Каждого ЭлементДубль Из ИтогПроверки.МассивДублей Цикл
					ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДубль.ТекстСообщения, ЭлементДубль.Ключ);
				КонецЦикла;

			Иначе

				ДанныеСтроки.Представление = "";
				СообщениеОбщееПояснение = 
					"Если номер имеет другой формат (например, это заграничный номер), нажмите на кнопку выбора или F4 и введите номер";		
				
				СообщениеДляВывода = ИтогПроверки.СообщениеОшибки + Символы.ПС + СообщениеОбщееПояснение; 
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеДляВывода, , Элемент.Имя);
				
			КонецЕсли;
			
			Форма[ДанныеСтроки.ИмяРеквизита] = "";
			СтрокиКонтактнойИнформации[0].Представление = "";
			СтрокиКонтактнойИнформации[0].Значение = "";
			
		КонецЕсли;
		//-- #1152 смарт: Лопато 18.10.2024
		
	КонецЕсли;
	//--#1012 смарт: Холопов 04.05.2022
	#КонецВставки

КонецПроцедуры //--#1012 смарт: Холопов 04.05.2022

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации
&ИзменениеИКонтроль("КонтактнаяИнформацияДобавитьПолеВводаЗавершение")
Процедура смарт_КонтактнаяИнформацияДобавитьПолеВводаЗавершение(Знач ВыбранныйЭлемент, Знач ДополнительныеПараметры)
	Если ВыбранныйЭлемент = Неопределено Тогда
		// Отказ от выбора
		Возврат;
	КонецЕсли;

	Результат = Новый Структура();
	Результат.Вставить("ДобавляемыйВид", ВыбранныйЭлемент.Значение);
	Результат.Вставить("ИмяЭлементаДляРазмещения", ДополнительныеПараметры.ИмяЭлементаДляРазмещения);
	Результат.Вставить("ИмяКоманды", ДополнительныеПараметры.ИмяКоманды);
	Если ВыбранныйЭлемент.Значение.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Результат.Вставить("ОбновитьКонтекстноеМеню", Истина);
	КонецЕсли;

	ОбновитьКонтактнуюИнформациюФормы(ДополнительныеПараметры.Форма, Результат);

	#Вставка
	//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при контактной информации	
	Форма = ДополнительныеПараметры.Форма;
	ТекЭлемент = Форма.ТекущийЭлемент;
	ТекЭлементИмя = ТекЭлемент.Имя;
	
	Отбор = Новый Структура("ИмяРеквизита", ТекЭлементИмя);
	Строки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	
	Если ДанныеСтроки <> Неопределено Тогда
		
		Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
			
			ТекЭлемент.ПодсказкаВвода 		= "+7 ХХХ ХХХ ХХ ХХ или 8 ХХХ ХХХ ХХ ХХ БЕЗ ПРОБЕЛОВ";
			ТекЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
			ТекЭлемент.Подсказка			= "Если номер имеет заграничный формат, нажмите на кнопку выбора или F4 и введите номер";
			
		КонецЕсли;
	КонецЕсли;
	//--#1012 смарт: Холопов 04.05.2022
	#КонецВставки
	
КонецПроцедуры //--#1012 смарт: Холопов 04.05.2022

#КонецОбласти
